src/AccumulationRegisters/ЗапасыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ЗапасыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Comment>Документ оказания услуг, реализации товаров</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументАванса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоАванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/Сертификаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Сертификаты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Клиент владелец сертификата</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ПартииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/НарядЗаказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>НарядЗаказы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КлючСтроки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗуба</Name>
					<Comment>Номер зуба(лечение)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Зубы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Лаборатория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НарядЗаказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ПродажиСебестоимость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиСебестоимость</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубнойТехник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУЕТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтрагентПлательщик</Name>
					<Comment>Контрагент плательщик</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗуба</Name>
					<Comment>Номер зуба(лечение)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Зубы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубнойТехник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КартаКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/CommonModules/ДвиженияДокументовСервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Выполняет инициализацию дополнительных свойств для проведения документа.
//  Параметры:
//   ДокументСсылка - ссылка на документ, в котором инициализируем дополнительные параметры;
//   СтруктураДополнительныеСвойства - структура, дополнительные свойства.
//
Процедура ИнициализироватьДополнительныеСвойстваДляПроведения(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	// В структуре "ДополнительныеСвойства" создаются свойства
	// с ключами "ТаблицыДляДвижений", "ДляПроведения", "УчетнаяПолитика".
	
	// "ТаблицыДляДвижений" - структура, которая будет содержать таблицы значений с данными для выполнения движений.
	СтруктураДополнительныеСвойства.Вставить("ТаблицыДляДвижений", Новый Структура);
	
	// "ДляПроведения" - структура, содержащая свойства и реквизиты документа, необходимые для проведения.
	СтруктураДополнительныеСвойства.Вставить("ДляПроведения", Новый Структура);
	
	// Структура, содержащая ключ с именем "МенеджерВременныхТаблиц",
	// в значении которого хранится менеджер временных таблиц.
	// Содержит для каждой временной таблицы ключ (имя временной таблицы)
	// и значение (признак наличия записей во временной таблице).
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("СтруктураВременныеТаблицы", Новый Структура("МенеджерВременныхТаблиц", Новый МенеджерВременныхТаблиц));
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("МетаданныеДокумента", ДокументСсылка.Метаданные());
	
	// "УчетнаяПолитика" - структура, содержащая значения всех параметров учетной политики на момент времени документа
	// и по выбранной в документе организации или по компании (в случае ведения учета по компании).
	СтруктураДополнительныеСвойства.Вставить("УчетнаяПолитика", Новый Структура);
	
	// Запрос, получающий данные документа.
	Запрос = Новый Запрос(
	"ВЫБРАТЬ 
	|	_Документ_.Ссылка КАК Ссылка,
	|	_Документ_.Номер КАК Номер,
	|	_Документ_.Дата КАК Дата,
	|   " + ?(СтруктураДополнительныеСвойства.ДляПроведения.МетаданныеДокумента.Реквизиты.Найти("Склад") <> Неопределено, "_Документ_.Склад" , "ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)") + " КАК Склад,
	|   " + ?(СтруктураДополнительныеСвойства.ДляПроведения.МетаданныеДокумента.Реквизиты.Найти("СтруктурнаяЕдиница") <> Неопределено, "_Документ_.СтруктурнаяЕдиница" , "ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)") + " КАК СтруктурнаяЕдиница,
	|   " + ?(СтруктураДополнительныеСвойства.ДляПроведения.МетаданныеДокумента.Реквизиты.Найти("СкладПолучатель") <> Неопределено,"_Документ_.СкладПолучатель КАК СкладПолучатель,", "")+" 
	|   " + ?(СтруктураДополнительныеСвойства.ДляПроведения.МетаданныеДокумента.Реквизиты.Найти("СтруктурнаяЕдиницаПолучатель") <> Неопределено,"_Документ_.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,", "")+" 
	|   " + ?(СтруктураДополнительныеСвойства.ДляПроведения.МетаданныеДокумента.Реквизиты.Найти("СуммаОплачено") <> Неопределено,"_Документ_.СуммаОплачено КАК СуммаОплачено,", "")+" 
	|   " + ?(СтруктураДополнительныеСвойства.ДляПроведения.МетаданныеДокумента.Реквизиты.Найти("Контрагент") <> Неопределено,"_Документ_.Контрагент КАК Контрагент,", "")+" 
	|	_Документ_.МоментВремени КАК МоментВремени,
	|	_Документ_.Представление КАК Представление
	|ИЗ
	|	Документ." + СтруктураДополнительныеСвойства.ДляПроведения.МетаданныеДокумента.Имя + " КАК _Документ_
	|ГДЕ
	|	_Документ_.Ссылка = &ДокументСсылка");
	
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Формирование ключей, содержащих данные документа.
	Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
		
		СтруктураДополнительныеСвойства.ДляПроведения.Вставить(Колонка.Имя);
		
	КонецЦикла;
	
	ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаИзРезультатаЗапроса.Следующий();
	
	// Заполнение значений для ключей, содержащих данные документа.
	ЗаполнитьЗначенияСвойств(СтруктураДополнительныеСвойства.ДляПроведения, ВыборкаИзРезультатаЗапроса);
	
	// Определение и установка значения момента, на который должен быть выполнен контроль документа.
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("МоментКонтроля", Дата('00010101'));
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("ПериодКонтроля", Дата("39991231"));
		
	СтруктураДополнительныеСвойства.УчетнаяПолитика.Вставить("ИспользоватьПартии", Истина);
	
	ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаИзРезультатаЗапроса.Следующий();
	
	// Заполнение значений для ключей, содержащих данные учетной политики.
	ЗаполнитьЗначенияСвойств(СтруктураДополнительныеСвойства.УчетнаяПолитика, ВыборкаИзРезультатаЗапроса);
	
КонецПроцедуры // ИнициализироватьДополнительныеСвойстваДляПроведения()

// Процедура выполняет пордготовку наборов записей документа к записи движений.
// 1. Очищает наборы записей от "старых записей" (ситуация возможна только в толстом клиенте)
// 2. Взводит флаг записи у наборов, по которым документ имеет движения
// Вызывается из модуля документов при проведении.
//
Процедура ПодготовитьНаборыЗаписейКРегистрацииДвижений(Объект) Экспорт

	Для Каждого НаборЗаписей Из Объект.Движения Цикл

		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;

	КонецЦикла;

	Если Не Объект.ДополнительныеСвойства.ЭтоНовый Тогда

		// Регистры, движения по которым формируются не из модуля менеджера документа.
		ИсключаемыеРегистры = Новый Массив;
		ИсключаемыеРегистры.Добавить("ГрафикДвиженияТоваров");

		МассивИменРегистров = ПолучитьМассивИспользуемыхРегистров(Объект.Ссылка,
				Объект.ДополнительныеСвойства.ДляПроведения.МетаданныеДокумента.Движения,
				ИсключаемыеРегистры);

		Для Каждого ИмяРегистра Из МассивИменРегистров Цикл
			Объект.Движения[ИмяРегистра].Записывать = Истина;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

// Функция формирует массив имен регистров, по которым документ имеет движения.
// Вызывается при подготовке записей к регистрации движений.
//
Функция ПолучитьМассивИспользуемыхРегистров(Регистратор, Движения, МассивИсключаемыхРегистров = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);

	Результат = Новый Массив;
	МаксимумТаблицВЗапросе = 256;

	СчетчикТаблиц   = 0;
	СчетчикДвижений = 0;

	ВсегоДвижений = Движения.Количество();
	ТекстЗапроса  = "";
	Для Каждого Движение Из Движения Цикл

		СчетчикДвижений = СчетчикДвижений + 1;

		ПропуститьРегистр = МассивИсключаемыхРегистров <> Неопределено
							И МассивИсключаемыхРегистров.Найти(Движение.Имя) <> Неопределено;

		Если Не ПропуститьРегистр Тогда

			Если СчетчикТаблиц > 0 Тогда

				ТекстЗапроса = ТекстЗапроса + "
				|ОБЪЕДИНИТЬ ВСЕ
				|";

			КонецЕсли;

			СчетчикТаблиц = СчетчикТаблиц + 1;

			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|""" + Движение.Имя + """ КАК ИмяРегистра
			|
			|ИЗ " + Движение.ПолноеИмя() + "
			|
			|ГДЕ Регистратор = &Регистратор
			|";

		КонецЕсли;

		Если СчетчикТаблиц = МаксимумТаблицВЗапросе Или СчетчикДвижений = ВсегоДвижений Тогда

			Запрос.Текст  = ТекстЗапроса;
			ТекстЗапроса  = "";
			СчетчикТаблиц = 0;

			Если Результат.Количество() = 0 Тогда

				Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИмяРегистра");

			Иначе

				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					Результат.Добавить(Выборка.ИмяРегистра);
				КонецЦикла;

			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Добавляет наборы записей документа.
//  Параметры:
//   СтруктураОбъект - структура данных документа для добавления движений
//
Процедура ДобавитьНаборыЗаписей(СтруктураОбъект, Отказ = Ложь) Экспорт
	
	ЭтоФоноваяЗадача = ОбщегоНазначенияПовтИсп.ЭтоСеансРегламентногоЗадания();
	
	МассивДвижений = СтруктураОбъект.Движения;

	
	НачатьТранзакцию();
	
	Для каждого НаборЗаписей из МассивДвижений Цикл
		
		Если ТипЗнч(НаборЗаписей) = Тип("КлючИЗначение") Тогда   			
			НаборЗаписей = НаборЗаписей.Значение;        			
		КонецЕсли;
		
		Если НаборЗаписей.Записывать Тогда
			
			Если НЕ НаборЗаписей.ДополнительныеСвойства.Свойство("ДляПроведения") Тогда				
				НаборЗаписей.ДополнительныеСвойства.Вставить("ДляПроведения", Новый Структура);				
			КонецЕсли;
			
			Если НЕ НаборЗаписей.ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда				
				НаборЗаписей.ДополнительныеСвойства.ДляПроведения.Вставить("СтруктураВременныеТаблицы", СтруктураОбъект.ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы);			
			КонецЕсли;
			
			Если ЭтоФоноваяЗадача = Ложь Тогда
				
				ПОПЫТКА
					НаборЗаписей.Записать();
				Исключение
					ОписаниеОшибки = ОписаниеОшибки();
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
					Отказ = Истина;
				КОНЕЦПОПЫТКИ;	
				
			Иначе  				
				НаборЗаписей.Записать();	
			КонецЕсли;
			
		КонецЕсли;
		
		НаборЗаписей.Записывать = Ложь;				

		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////
// РЕГИСТРЫ ПОДЧИНЕННЫЕ РЕГИСТРАТОРУ

// Выполняет движения регистра накопления ЗапасыНаСкладах.
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура ЗапасыНаСкладах(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаЗапасыНаСкладах = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыНаСкладах;
	
	ДвиженияЗапасыНаСкладах = Движения.ЗапасыНаСкладах;
	ДвиженияЗапасыНаСкладах.Записывать = Истина;
	ДвиженияЗапасыНаСкладах.Загрузить(ТаблицаЗапасыНаСкладах);
	
КонецПроцедуры // ОтразитьЗапасыНаСкладах()
 
// Выполняет движения регистра накопления ВзаиморасчетыСКонтрагентами.
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура ВзаиморасчетыСКонтрагентами(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаВзаиморасчетыСКонтрагентами = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВзаиморасчетыСКонтрагентами;
	
	ДвиженияВзаиморасчетыСКонтрагентами = Движения.ВзаиморасчетыСКонтрагентами;
	ДвиженияВзаиморасчетыСКонтрагентами.Записывать = Истина;
	ДвиженияВзаиморасчетыСКонтрагентами.Загрузить(ТаблицаВзаиморасчетыСКонтрагентами);
	
КонецПроцедуры // ОтразитьЗапасыНаСкладах()

// Выполняет движения регистра накопления Сертификаты.
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура Сертификаты(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаСертификаты = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСертификаты;

	ДвиженияСертификаты = Движения.Сертификаты;
	ДвиженияСертификаты.Записывать = Истина;    
	ДвиженияСертификаты.Загрузить(ТаблицаСертификаты);
	
КонецПроцедуры

// Выполняет движения регистра накопления ПартииТоваров.
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура ПартииТоваров(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПартииТоваров = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПартииТоваров;

	ДвиженияПартииТоваров = Движения.ПартииТоваров;
	ДвиженияПартииТоваров.Записывать = Истина;
	ДвиженияПартииТоваров.Загрузить(ТаблицаПартииТоваров);
	
КонецПроцедуры

// Выполняет движения регистра накопления НарядЗаказы.
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура НарядЗаказы(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаНарядЗаказы = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНарядЗаказы;

	ДвиженияНарядЗаказы = Движения.НарядЗаказы;
	ДвиженияНарядЗаказы.Записывать = Истина;
	ДвиженияНарядЗаказы.Загрузить(ТаблицаНарядЗаказы);
	
КонецПроцедуры

// Выполняет движения регистра накопления ПродажиСебестоимость.
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура ПродажиСебестоимость(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПродажиСебестоимость = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПродажиСебестоимость;

	ДвиженияПродажисебестоимость = Движения.ПродажиСебестоимость;
	ДвиженияПродажисебестоимость.Записывать = Истина;
	ДвиженияПродажисебестоимость.Загрузить(ТаблицаПродажиСебестоимость);
	
КонецПроцедуры

// Выполняет движения регистра накопления Продажи.
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура Продажи(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПродажи = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПродажи;

	ДвиженияПродажи = Движения.Продажи;
	ДвиженияПродажи.Записывать = Истина;
	ДвиженияПродажи.Загрузить(ТаблицаПродажи);
	
КонецПроцедуры

// Выполняет движения регистра накопления ВремяРаботыСотрудниковФакт.
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура ВремяРаботыСотрудниковФакт(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаВремяРаботыСотрудниковФакт = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВремяРаботыСотрудниковФакт;

	ДвиженияВремяРаботыСотрудниковФакт = Движения.ВремяРаботыСотрудниковФакт;
	ДвиженияВремяРаботыСотрудниковФакт.Записывать = Истина;
	ДвиженияВремяРаботыСотрудниковФакт.Загрузить(ТаблицаВремяРаботыСотрудниковФакт);
	
КонецПроцедуры

// Выполняет движения регистра накопления ДействиеСкидокНаценок.
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура ДействиеСкидокНаценок(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДействиеСкидокНаценок = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДействиеСкидокНаценок;

	ДвиженияДействиеСкидокНаценок = Движения.ДействиеСкидокНаценок;
	ДвиженияДействиеСкидокНаценок.Записывать = Истина;
	ДвиженияДействиеСкидокНаценок.Загрузить(ТаблицаДействиеСкидокНаценок);
	
КонецПроцедуры

  // Выполняет движения регистра накопления РабочееВремяСотрудников.
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура РабочееВремяСотрудников(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаРабочееВремяСотрудников = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРабочееВремяСотрудников;

	ДвиженияРабочееВремяСотрудников = Движения.РабочееВремяСотрудников;
	ДвиженияРабочееВремяСотрудников.Записывать = Истина;
	ДвиженияРабочееВремяСотрудников.Загрузить(ТаблицаРабочееВремяСотрудников);
	
КонецПроцедуры

// Выполняет движения регистра накопления ДенежныеСредства.
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура ДенежныеСредства(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДенежныеСредства = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДенежныеСредства;

	ДвиженияДенежныеСредства = Движения.ДенежныеСредства;
	ДвиженияДенежныеСредства.Записывать = Истина;
	ДвиженияДенежныеСредства.Загрузить(ТаблицаДенежныеСредства);
	
КонецПроцедуры

// Выполняет движения регистра накопления РасчетыСПодотчетниками.
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура РасчетыСПодотчетниками(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаРасчетыСПодотчетниками = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПодотчетниками;

	ДвиженияРасчетыСПодотчетниками = Движения.РасчетыСПодотчетниками;
	ДвиженияРасчетыСПодотчетниками.Записывать = Истина;
	ДвиженияРасчетыСПодотчетниками.Загрузить(ТаблицаРасчетыСПодотчетниками);
	
КонецПроцедуры
     
// Выполняет движения регистра накопления ДенежныеСредстваНаЛицевыхСчетах.
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура ДенежныеСредстваНаЛицевыхСчетах(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДенежныеСредстваНаЛицевыхСчетах = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДенежныеСредстваНаЛицевыхСчетах;

	ДенежныеСредстваНаЛицевыхСчетах = Движения.ДенежныеСредстваНаЛицевыхСчетах;
	ДенежныеСредстваНаЛицевыхСчетах.Записывать = Истина;
	ДенежныеСредстваНаЛицевыхСчетах.Загрузить(ТаблицаДенежныеСредстваНаЛицевыхСчетах);
	
КонецПроцедуры

// Выполняет движения регистра сведений СерийныеНомераСертификатов.
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура СерийныеНомераСертификатов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаНомераСертификатов = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНомераСертификатов;

	ДвиженияНомераСертификатов = Движения.СерийныеНомераСертификатов;
	ДвиженияНомераСертификатов.Записывать = Истина;
	ДвиженияНомераСертификатов.Загрузить(ТаблицаНомераСертификатов);	
	
КонецПроцедуры

// Выполняет движения регистра сведений СерийныеНомераСертификатов.
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура ГарантияНаУслуги(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаГарантияНаУслуги = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаГарантияНаУслуги;

	ДвиженияГарантияНаУслуги = Движения.ГарантияНаУслуги;
	ДвиженияГарантияНаУслуги.Записывать = Истина;
	ДвиженияГарантияНаУслуги.Загрузить(ТаблицаГарантияНаУслуги);	
	
КонецПроцедуры

// Выполняет движения регистра сведений СерийныеНомераСертификатов.
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура МатериалыКСписанию(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаМатериалыКСписанию = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаМатериалыКСписанию;

	ДвиженияМатериалыКСписанию = Движения.МатериалыКСписанию;
	ДвиженияМатериалыКСписанию.Записывать = Истина;
	ДвиженияМатериалыКСписанию.Загрузить(ТаблицаМатериалыКСписанию);	
	
КонецПроцедуры

// Выполняет движения регистра сведений СерийныеНомераСертификатов.
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура РасчетыСПерсоналом(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаРасчетыСПерсоналом = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПерсоналом;

	ДвиженияРасчетыСПерсоналом = Движения.РасчетыСПерсоналом;
	ДвиженияРасчетыСПерсоналом.Записывать = Истина;
	ДвиженияРасчетыСПерсоналом.Загрузить(ТаблицаРасчетыСПерсоналом);	
	
КонецПроцедуры

// Выполняет движения регистра сведений РасчетыСПерсоналом.
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура РасчетыПоЭквайрингу(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаРасчетыПоЭквайрингу = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыПоЭквайрингу;

	ДвиженияРасчетыПоЭквайрингу = Движения.РасчетыПоЭквайрингу;
	ДвиженияРасчетыПоЭквайрингу.Записывать = Истина;
	ДвиженияРасчетыПоЭквайрингу.Загрузить(ТаблицаРасчетыПоЭквайрингу);	
	
КонецПроцедуры

// Процедура, выполняет движение по регистру накопления "ПредоставленныеСкидки".
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура ОборотыПредоставленныеСкидки(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПредоставленныеСкидки = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПредоставленныеСкидки;

	ДвиженияПредоставленныеСкидки = Движения.ПредоставленныеСкидки;
	ДвиженияПредоставленныеСкидки.Записывать = Истина;
	ДвиженияПредоставленныеСкидки.Загрузить(ТаблицаПредоставленныеСкидки);
	
КонецПроцедуры

// Выполняет движения оборотного регистра Затраты.
//
Процедура Затраты(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаЗатраты = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗатраты;

	ДвиженияЗатраты = Движения.Затраты;
	ДвиженияЗатраты.Записывать = Истина;
	ДвиженияЗатраты.Загрузить(ТаблицаЗатраты);
	
КонецПроцедуры

// Выполняет движения оборотного регистра ПланыЛечения.
//
Процедура ПланыЛечения(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПланыЛечения = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПланыЛечения;

	ДвиженияЗатраты = Движения.ПланыЛечения;
	ДвиженияЗатраты.Записывать = Истина;
	ДвиженияЗатраты.Загрузить(ТаблицаПланыЛечения);
	
КонецПроцедуры

// Выполняет движения регистра бухгалтерии Управленческий.
//
Процедура Управленческий(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаУправленческий = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий;
	
	Если Отказ
	 ИЛИ ТаблицаУправленческий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияУправленческий = Движения.Управленческий;
	ДвиженияУправленческий.Записывать = Истина;
	
	Для каждого СтрокаТаблицаУправленческий Из ТаблицаУправленческий Цикл		
		// Заполнение основных реквизитов
		ДвижениеУправленческий = ДвиженияУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(ДвижениеУправленческий, СтрокаТаблицаУправленческий);
		
		ВидСубконтоДт1 = Неопределено;
		ВидСубконтоДт2 = Неопределено;
		ВидСубконтоДт3 = Неопределено;
		ВидСубконтоДт4 = Неопределено;

		ВидСубконтоКт1 = Неопределено;
		ВидСубконтоКт2 = Неопределено;
		ВидСубконтоКт3 = Неопределено;
		ВидСубконтоКт4 = Неопределено;
		
		// Определяем наличие субконто в данных
		Если ТаблицаУправленческий.Колонки.Найти("СубконтоДт1") <> Неопределено И ЗначениеЗаполнено(СтрокаТаблицаУправленческий.СубконтоДт1) Тогда
			ВидСубконтоДт1 = ПланыВидовХарактеристик.ВидыСубконто.ПолучитьВидСубконтоПоЗначению(ДвижениеУправленческий.СчетДт.Ссылка.ВидыСубконто,СтрокаТаблицаУправленческий.СубконтоДт1); 			
		КонецЕсли;
		Если ТаблицаУправленческий.Колонки.Найти("СубконтоДт2") <> Неопределено И ЗначениеЗаполнено(СтрокаТаблицаУправленческий.СубконтоДт2) Тогда
			ВидСубконтоДт2 = ПланыВидовХарактеристик.ВидыСубконто.ПолучитьВидСубконтоПоЗначению(ДвижениеУправленческий.СчетДт.Ссылка.ВидыСубконто,СтрокаТаблицаУправленческий.СубконтоДт2); 			
		КонецЕсли; 
		Если ТаблицаУправленческий.Колонки.Найти("СубконтоДт3") <> Неопределено И ЗначениеЗаполнено(СтрокаТаблицаУправленческий.СубконтоДт3) Тогда
			ВидСубконтоДт3 = ПланыВидовХарактеристик.ВидыСубконто.ПолучитьВидСубконтоПоЗначению(ДвижениеУправленческий.СчетДт.Ссылка.ВидыСубконто,СтрокаТаблицаУправленческий.СубконтоДт3); 			
		КонецЕсли;
		Если ТаблицаУправленческий.Колонки.Найти("СубконтоДт4") <> Неопределено И ЗначениеЗаполнено(СтрокаТаблицаУправленческий.СубконтоДт4) Тогда
			ВидСубконтоДт4 = ПланыВидовХарактеристик.ВидыСубконто.ПолучитьВидСубконтоПоЗначению(ДвижениеУправленческий.СчетДт.Ссылка.ВидыСубконто,СтрокаТаблицаУправленческий.СубконтоДт4); 			
		КонецЕсли; 
		
		Если ТаблицаУправленческий.Колонки.Найти("СубконтоКт1") <> Неопределено И ЗначениеЗаполнено(СтрокаТаблицаУправленческий.СубконтоКт1) Тогда
			ВидСубконтоКт1 = ПланыВидовХарактеристик.ВидыСубконто.ПолучитьВидСубконтоПоЗначению(ДвижениеУправленческий.СчетКт.Ссылка.ВидыСубконто,СтрокаТаблицаУправленческий.СубконтоКт1); 			
		КонецЕсли;
		Если ТаблицаУправленческий.Колонки.Найти("СубконтоКт2") <> Неопределено И ЗначениеЗаполнено(СтрокаТаблицаУправленческий.СубконтоКт2) Тогда
			ВидСубконтоКт2 = ПланыВидовХарактеристик.ВидыСубконто.ПолучитьВидСубконтоПоЗначению(ДвижениеУправленческий.СчетКт.Ссылка.ВидыСубконто,СтрокаТаблицаУправленческий.СубконтоКт2); 			
		КонецЕсли;
	    Если ТаблицаУправленческий.Колонки.Найти("СубконтоКт3") <> Неопределено И ЗначениеЗаполнено(СтрокаТаблицаУправленческий.СубконтоКт3) Тогда
			ВидСубконтоКт3 = ПланыВидовХарактеристик.ВидыСубконто.ПолучитьВидСубконтоПоЗначению(ДвижениеУправленческий.СчетКт.Ссылка.ВидыСубконто,СтрокаТаблицаУправленческий.СубконтоКт3); 			
		КонецЕсли;
		Если ТаблицаУправленческий.Колонки.Найти("СубконтоКт4") <> Неопределено И ЗначениеЗаполнено(СтрокаТаблицаУправленческий.СубконтоКт4) Тогда
			ВидСубконтоКт4 = ПланыВидовХарактеристик.ВидыСубконто.ПолучитьВидСубконтоПоЗначению(ДвижениеУправленческий.СчетКт.Ссылка.ВидыСубконто,СтрокаТаблицаУправленческий.СубконтоКт4); 			
		КонецЕсли;
	
		// Заполняем значения субконто
		Если ВидСубконтоДт1 <> Неопределено Тогда				
			ДвижениеУправленческий.СубконтоДт[ВидСубконтоДт1] = СтрокаТаблицаУправленческий.СубконтоДт1;
		КонецЕсли;
		Если ВидСубконтоДт2 <> Неопределено Тогда
			ДвижениеУправленческий.СубконтоДт[ВидСубконтоДт2] = СтрокаТаблицаУправленческий.СубконтоДт2;
		КонецЕсли;
		Если ВидСубконтоДт3 <> Неопределено Тогда				
			ДвижениеУправленческий.СубконтоДт[ВидСубконтоДт3] = СтрокаТаблицаУправленческий.СубконтоДт3;
		КонецЕсли;
		Если ВидСубконтоДт4 <> Неопределено Тогда
			ДвижениеУправленческий.СубконтоДт[ВидСубконтоДт4] = СтрокаТаблицаУправленческий.СубконтоДт4;
		КонецЕсли;
	
		Если ВидСубконтоКт1 <> Неопределено Тогда
			ДвижениеУправленческий.СубконтоКт[ВидСубконтоКт1] = СтрокаТаблицаУправленческий.СубконтоКт1;
		КонецЕсли;
        Если ВидСубконтоКт2 <> Неопределено Тогда
			ДвижениеУправленческий.СубконтоКт[ВидСубконтоКт2] = СтрокаТаблицаУправленческий.СубконтоКт2;
		КонецЕсли;
		Если ВидСубконтоКт3 <> Неопределено Тогда
			ДвижениеУправленческий.СубконтоКт[ВидСубконтоКт3] = СтрокаТаблицаУправленческий.СубконтоКт3;
		КонецЕсли;
        Если ВидСубконтоКт4 <> Неопределено Тогда
			ДвижениеУправленческий.СубконтоКт[ВидСубконтоКт4] = СтрокаТаблицаУправленческий.СубконтоКт4;
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

// Выполняет движения регистра накопления БонусныеСчета.
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура БонусныеСчета(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаБонусныеСчета = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаБонусныеСчета;

	ДвиженияБонусныеСчета = Движения.БонусныеСчета;
	ДвиженияБонусныеСчета.Записывать = Истина;
	ДвиженияБонусныеСчета.Загрузить(ТаблицаБонусныеСчета);
	
КонецПроцедуры

// Процедура определяет ситуацию, когда при изменении своей даты документ 
// оказывается в другом периоде нумерации документов, и в это м случае
// присваивает документу новый уникальный номер.
//
// Параметры:
//  ДокументСсылка - ссылка на документ,из которого вызвана процедура 
//  НоваяДатаДокумента - новая дата документа 
//  НачальнаяДатаДокумента - начальная дата документа 
//
// Возвращаемое значение:
//  Число - разность дат.
//
Функция ПроверитьНомерДокумента(ДокументСсылка, НоваяДатаДокумента, НачальнаяДатаДокумента) Экспорт
	
	// Определяем назначенную для данного вида документов периодичность смены номера
	ПериодСменыНомера = ДокументСсылка.Метаданные().ПериодичностьНомера;
	
	// В зависимости от установленной периодичности смены номеров,
	// определяем разность старой и новой датами документа.
	Если ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
		РазностьДат = НачалоГода(НачальнаяДатаДокумента) - НачалоГода(НоваяДатаДокумента);
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
		РазностьДат = НачалоКвартала(НачальнаяДатаДокумента) - НачалоКвартала(НоваяДатаДокумента);
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
		РазностьДат = НачалоМесяца(НачальнаяДатаДокумента) - НачалоМесяца(НоваяДатаДокумента);
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.День Тогда
		РазностьДат = НачальнаяДатаДокумента - НоваяДатаДокумента;
	Иначе
		Возврат 0;
	КонецЕсли;
	
	Возврат РазностьДат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////
// РЕГИСТРЫ НЕ ПОДЧИНЕННЫЕ РЕГИСТРАТОРУ

// Выполняет движения регистра сведения ЦеныНоменклатуры.
//  Параметры:
//   ДополнительныеСвойства - структура, дополнительные свойства для проведения документа;
//   Движения - набор движений документа;
//   Отказ    - булево, признак отказа записи набора данных.
//
Процедура УстановкаЦен(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаУстановкаЦен = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУстановкаЦен;
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;

	// Удаляем цены из регистра по документу
	ДвиженияДокументовСервер.УдалениеЦен(ДополнительныеСвойства.ДляПроведения.Ссылка, Движения, Отказ);
	
	// Добавляем цены в регистр
	Для Каждого СтрокаУстановкаЦен Из ТаблицаУстановкаЦен Цикл
		ЦеныНоменклатуры = РегистрыСведений.ЦеныНоменклатуры;    
		СтруктураРесурсов = ЦеныНоменклатуры.ПолучитьПоследнее(СтрокаУстановкаЦен.Период, СтрокуТаблицыЗначенийВСтруктуру(СтрокаУстановкаЦен, ТаблицаУстановкаЦен.СкопироватьКолонки("Номенклатура, СтруктурнаяЕдиница, ВидЦен, Упаковка")));
		Если СтруктураРесурсов.Цена = NULL ИЛИ СтруктураРесурсов.Цена = Неопределено ИЛИ СтруктураРесурсов.Цена <> СтрокаУстановкаЦен.Цена Тогда			
			ДвиженияУстановкаЦен = ЦеныНоменклатуры.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(ДвиженияУстановкаЦен, СтрокаУстановкаЦен);
			ДвиженияУстановкаЦен.ДокументРегистратор = ДополнительныеСвойства.ДляПроведения.Ссылка;
			ДвиженияУстановкаЦен.Записать();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Удаляет движения регистра сведения ЦеныНоменклатуры.
//  Параметры:
//   ДокументДвижения - Документ, который производил движение по регистру;
//
Процедура УдалениеЦен(ДокументРегистратор, Движения, Отказ) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Удаляем цены из регистра по документу
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатуры.Период,
	|	ЦеныНоменклатуры.СтруктурнаяЕдиница,
	|	ЦеныНоменклатуры.ВидЦен,
	|	ЦеныНоменклатуры.Номенклатура,
	|	ЦеныНоменклатуры.Упаковка
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|ГДЕ
	|	ЦеныНоменклатуры.ДокументРегистратор = &ДокументРегистратор";

	
	Запрос.УстановитьПараметр("ДокументРегистратор", ДокументРегистратор);
	

	ТаблицаЗаписей = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТаблицы Из ТаблицаЗаписей Цикл
		НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(СтрокаТаблицы.Период);
		НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(СтрокаТаблицы.СтруктурнаяЕдиница);
		НаборЗаписей.Отбор.ВидЦен.Установить(СтрокаТаблицы.ВидЦен);
		НаборЗаписей.Отбор.Номенклатура.Установить(СтрокаТаблицы.Номенклатура);
		НаборЗаписей.Отбор.Упаковка.Установить(СтрокаТаблицы.Упаковка);
		НаборЗаписей.Записать();
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти
